dhzl84/ESP8266-Smart-Home/src/main.cpp
/*===================================================================================================================*/
/* includes */
/*===================================================================================================================*/
#include <Arduino.h>

#include "config.h"
/* the config.h file contains your personal configuration of the parameters below: 
  #define WIFI_SSID                   "xxx"
  #define WIFI_PWD                    "xxx"
  #define LOCAL_MQTT_USER             "xxx"
  #define LOCAL_MQTT_PWD              "xxx"
  #define LOCAL_MQTT_PORT             1234
  #define LOCAL_MQTT_HOST             "123.456.789.012"
  #define THERMOSTAT_BINARY           "http://<domain or ip>/<name>.bin"
  #define SENSOR_UPDATE_INTERVAL      20000
*/

#include "version.h"
#include "main.h"
#include <ESP8266WiFi.h>
#include <DHTesp.h>
#include "cThermostat.h"
#include <osapi.h>   /* for sensor timer */
#include <os_type.h> /* for sensor timer */
#include "cSystemState.h"
#include "UserFonts.h"
#include <SSD1306.h>
#include "MQTTClient.h"
#include "cMQTT.h"
#include <ESP8266httpUpdate.h>
#include <ArduinoOTA.h>

/*===================================================================================================================*/
/* GPIO config */
/*===================================================================================================================*/
#define DHT_PIN              2 /* sensor */
#define SDA_PIN              4 /* I²C */
#define SCL_PIN              5 /* I²C */
#define ENCODER_PIN1        12 /* rotary left/right */
#define ENCODER_PIN2        13 /* rotary left/right */
#define ENCODER_BUTTON_PIN  14 /* push button switch */
#define RELAY_PIN           16 /* relay control */

/*===================================================================================================================*/
/* variables, constants, types, classes, etc. definitions */
/*===================================================================================================================*/
/* config */
struct configuration myConfig;
/* mqtt */
unsigned long  mqttReconnectTime       = 0;
unsigned long  mqttReconnectInterval   = MQTT_RECONNECT_TIME;
unsigned long  mqttPubCycleTime        = 0;
#define secondsToMillisecondsFactor 60000
/* loop handler */
#define loop50ms        50
#define loop100ms      100
#define loop500ms      500
#define loop1000ms    1000
unsigned long loop50msMillis   =  0;
unsigned long loop100msMillis  = 22; /* start loops with some offset to avoid calling all loops every second */
unsigned long loop500msMillis  = 44; /* start loops with some offset to avoid calling all loops every second */
unsigned long loop1000msMillis = 66; /* start loops with some offset to avoid calling all loops every second */
/* HTTP Update */
bool     FETCH_UPDATE          = false;       /* global variable used to decide whether an update shall be fetched from server or not */
/* OTA */
typedef enum otaUpdate { TH_OTA_IDLE, TH_OTA_ACTIVE, TH_OTA_FINISHED, TH_OTA_ERROR } OtaUpdate_t;       /* global variable used to change display in case OTA update is initiated */
OtaUpdate_t OTA_UPDATE = TH_OTA_IDLE;
/* rotary encoder */
unsigned long  switchDebounceTime          = 0;
unsigned long  switchDebounceInterval      = 250;
unsigned long  switchSystemResetTime       = 0;
unsigned long  switchSystemResetInterval   = 10000;
#define rotLeft              -1
#define rotRight              1
#define rotInit               0
#define tempStep              5
#define displayTemp           0
#define displayHumid          1
volatile int LAST_ENCODED                    = 0b11;        /* initial state of the rotary encoders gray code */
volatile int ROTARY_ENCODER_DIRECTION_INTS   = rotInit;     /* initialize rotary encoder with no direction */
/* sensor */
unsigned long readSensorScheduled = 0;
/* Display */
#define drawTempYOffset       16
#define drawTargetTempYOffset 0
#define drawHeating drawXbm(0,drawTempYOffset,myThermo_width,myThermo_height,myThermo)
/* classes */
DHTesp         myDHT;
SSD1306        myDisplay(0x3c,SDA_PIN,SCL_PIN);
WiFiClient     myWiFiClient;
Thermostat     myThermostat;
SystemState    mySystemState;
MQTTClient     myMqttClient(1024);
mqttHelper     myMqttHelper;

#define        SPIFFS_MQTT_ID_FILE        String("/itsme")
#define        SPIFFS_SENSOR_CALIB_FILE   String("/sensor")
#define        SPIFFS_TARGET_TEMP_FILE    String("/targetTemp")
#define        SPIFFS_WRITE_DEBOUNCE      20000 /* write target temperature to spiffs if it wasn't changed for 20 s (time in ms) */
boolean        SPIFFS_WRITTEN =           true;
unsigned long  SPIFFS_REFERENCE_TIME;

/*===================================================================================================================*/
/* The setup function is called once at startup of the sketch */
/*===================================================================================================================*/
void setup()
{
   Serial.begin(115200);
   delay(1000);
   #ifdef CFG_DEBUG
   Serial.println("Serial connection established");
   #endif

   SPIFFS_INIT();   /* read stuff from SPIFFS */
   GPIO_CONFIG();    /* configure GPIOs */
   myThermostat.setup(RELAY_PIN, myConfig.tTemp, myConfig.calibF, myConfig.calibO); /*GPIO to switch connected relay and initial target temperature */
   myDHT.setup(DHT_PIN, DHTesp::DHT22);    /* init DHT sensor */
   DISPLAY_INIT();   /* init Display */
   WIFI_CONNECT();   /* connect to WiFi */
   OTA_INIT();
   myMqttHelper.setup(String(myConfig.name));
   MQTT_CONNECT();   /* connect to MQTT host and build subscriptions, must be called after SPIFFS_INIT()*/

   /* enable interrupts on encoder pins to decode gray code and recognize switch event*/
   attachInterrupt(ENCODER_PIN1, updateEncoder, CHANGE);
   attachInterrupt(ENCODER_PIN2, updateEncoder, CHANGE);
   attachInterrupt(ENCODER_BUTTON_PIN, encoderSwitch, FALLING);
   
   SENSOR_MAIN();    /* acquire first sensor data before staring loop() */
}

/*===================================================================================================================*/
/* functions called by setup() */
/*===================================================================================================================*/
void SPIFFS_INIT(void)
{
   SPIFFS.begin();

   if (!SPIFFS.exists("/formatted"))
   {
      /* This code is only run once to format the SPIFFS before first usage */
      #ifdef CFG_DEBUG
      Serial.println("Formatting SPIFFS, this takes some time");
      #endif
      SPIFFS.format();
      #ifdef CFG_DEBUG
      Serial.println("Formatting SPIFFS finished");
      Serial.println("Open file '/formatted' in write mode");
      #endif
      File f = SPIFFS.open("/formatted", "w");
      if (!f) {
          Serial.println("file open failed");
      }
      else
      {
         f.close();
         delay(5000);
         if (!SPIFFS.exists("/formatted"))
         {
            Serial.println("That didn't work!");
         }
         else
         {
            #ifdef CFG_DEBUG
            Serial.println("Cool, working!");
            #endif
         }
      }
   }
   else
   {
      #ifdef CFG_DEBUG
      Serial.println("Found '/formatted' >> SPIFFS ready to use");
      #endif
   }
   #ifdef CFG_DEBUG
   Serial.println("Check if I remember who I am ... ");
   #endif

   #ifdef CFG_DEBUG
   Dir dir = SPIFFS.openDir("/");
   while (dir.next()) {
       Serial.print("SPIFFS file found: " + dir.fileName() + " - Size in byte: ");
       File f = dir.openFile("r");
       Serial.println(f.size());
   }
   #endif

   if (SPIFFS.exists(SPIFFS_MQTT_ID_FILE))  // fist time with new config
   {
      loadConfiguration(myConfig); // load fallback config here and overwite by legacy config
      String myName = readSpiffs(SPIFFS_MQTT_ID_FILE);

      if (myName != "")
      {
         myConfig.name = myName.c_str();
      }

      SPIFFS.remove(SPIFFS_MQTT_ID_FILE);  // delete file for next startup
   }
   else
   {
      loadConfiguration(myConfig); // load normal config
   }
   Serial.println("My name is: " + String(myConfig.name));

   String sensorCalib = readSpiffs(SPIFFS_SENSOR_CALIB_FILE);

   /* check parameters for Sensor calibration */
   if (sensorCalib != "")
   {
      int offset;
      int factor;

