dhzl84/ESP8266-Smart-Home/src/main.cpp
void messageReceived(String &topic, String &payload)
{
   #ifdef CFG_DEBUG
   Serial.println("received: " + topic + " : " + payload);
   #endif

   if (topic == myMqttHelper.getTopicSystemRestartRequest())
   {
      #ifdef CFG_DEBUG
      Serial.println("Restart request received with value: " + payload);
      #endif
      if ( (payload == "true") || (payload == "1") )
      {
         mySystemState.setSystemRestartRequest(true);
      }
   }

   /* HTTP Update */
   else if (topic == myMqttHelper.getTopicUpdateFirmware())
   {
      if ( (payload == "true") || (payload == "1") )
      {
         #ifdef CFG_DEBUG
         Serial.println("Firmware updated triggered via MQTT");
         #endif
         FETCH_UPDATE = true;
      }
      else
      {
         FETCH_UPDATE = false;
      }
   }

   /* check incoming target temperature, don't set same target temperature as new*/
   else if (topic == myMqttHelper.getTopicTargetTempCmd())
   {
      if (myThermostat.getTargetTemperature() != payload.toFloat())
      {
         /* set new target temperature for heating control, min/max limitation inside (string to float to int) */
         myThermostat.setTargetTemperature(floatToInt(payload.toFloat()));
      }
   }


   else if (topic == myMqttHelper.getTopicThermostatModeCmd())
   {
      if (String("heat") == payload)
      {
         myThermostat.setThermostatMode(TH_HEAT);
      }
      else if (String("off") == payload)
      {
         myThermostat.setThermostatMode(TH_OFF);
      }
      else
      {
          /* do nothing */
      }
   }


   else if (topic == myMqttHelper.getTopicChangeName())
   {
      #ifdef CFG_DEBUG
      Serial.println("New name received: " + payload);
      #endif
      if (payload != myMqttHelper.getName())
      {
         #ifdef CFG_DEBUG
         Serial.println("Old name was: " + myMqttHelper.getName());
         #endif
         myMqttHelper.changeName(payload);
      }
   }


   else if(topic == myMqttHelper.getTopicChangeSensorCalib())
   {
      #ifdef CFG_DEBUG
      Serial.println("New sensor calibration parameters received: " + payload);
      #endif

      int offset;
      int factor;

      if (splitSensorDataString(payload, &offset, &factor))
      {
         myThermostat.setSensorCalibData(offset, factor, true);
      }
   }
}

